course/Computability/report.org
#+title:Scott拓扑与\(D_\infty\)

#+AUTHOR: 陈淇奥
#+LATEX_HEADER: \input{../../preamble.tex}
#+LATEX_HEADER: \makeindex
#+LATEX_HEADER: \usepackage[UTF8]{ctex}
#+LATEX_HEADER: \DeclareMathOperator{\CPO}{\textbf{CPO}}

