course/Computability/report.tex
% Created 2022-06-29 Wed 01:14
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\input{../../preamble.tex}
\makeindex
\usepackage[UTF8]{ctex}
\DeclareMathOperator{\CPO}{\textbf{CPO}}
\author{陈淇奥}
\date{\today}
\title{Scott拓扑与\(D_\infty\)}
\hypersetup{
 pdfauthor={陈淇奥},
 pdftitle={Scott拓扑与\(D_\infty\)},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.92 (Org mode 9.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents
