course/Computability/report.tex


\section{Scott拓扑}
\label{sec:org0ae8830}
\begin{definition}[]
给定偏序集\(\la D,\sqsubseteq\ra\)以及集合\(X\subseteq D\)，
\begin{enumerate}
\item 用\(\bot\)表示\(D\)的 \textbf{最小元} ；
\item 用\(\bigsqcup X\)表示\(X\)的最小上界；
\item 若\(X\)非空且对任意\(a,b\in X\)都存在\(c\in X\)使得\(a\sqsubseteq c\)且\(b\sqsubseteq c\)，则称\(X\)是 \textbf{有向集} ；
\item 若\(D\)满足
\begin{enumerate}
\item \(D\)有最小元；
\item 每一个\(D\)的有向子集\(X\)都有最小上界。
\end{enumerate}
则称\(D\)是 \textbf{完全偏序} ，记作c.p.o.。
\end{enumerate}
\end{definition}

\begin{definition}[]
给定任意\(\bot\notin\N\)，定义\(\N^+=\N\cup\{\bot\}\)，并且对任意\(a,b\in\N^+\)，定义
\begin{equation*}
a\sqsubseteq b\Leftrightarrow(a=\bot\wedge b\in\N)\vee a=b
\end{equation*}
我们用\(\N^+\)表示\(\la\N^+,\sqsubseteq\ra\)。
\end{definition}

\begin{lemma}[]
\(\N^+\)是完全偏序。
\end{lemma}

\begin{proof}
注意到\(\N^+\)的有向子集只包括单点集与\(\{\bot,n\}\)，其中\(n\in\N\)
\end{proof}

\begin{definition}[]
给定完全偏序\(D,D'\)，令\(\phi\)是从\(D\)到\(D'\)的函数，定义\(\phi\)是 \textbf{单调的} 当且仅当
\begin{equation*}
a\sqsubseteq b\Rightarrow \phi(a)\sqsubseteq'\phi(b)
\end{equation*}
\(\phi\)是 \textbf{连续的} 当且仅当对于任意有向集\(X\subseteq D\)，
\begin{equation*}
\phi(\bigsqcup X)=\bigsqcup(\phi(X))
\end{equation*}
其中\(\phi(X)=\{\phi(x):x\in X\}\)，
\end{definition}

\begin{definition}[]
给定完全偏序\(\la D,\sqsubseteq\ra\)，定义\(D\)上的 \textbf{Scott拓扑} ：\(O\subseteq D\)是开集当且仅当
\begin{enumerate}
\item \(x\in O\wedge x\sqsubseteq y\Rightarrow y\in O\);
\item 若\(X\subseteq D\)有向且\(\bigsqcup X\in O\)，则\(X\cap O\neq\emptyset\)。
\end{enumerate}
\end{definition}

\begin{lemma}[]
令\(U_x=\{z\in D\mid z\not\sqsubseteq x\}\)，则\(U_x\)是开集
\end{lemma}

\begin{proof}
\begin{enumerate}
\item 若\(y\in U_x\)且\(y\sqsubseteq z\)，若\(z\sqsubseteq x\)，则\(y\sqsubseteq x\)矛盾。
\item 若\(X\subseteq D\)有向且\(\bigsqcup X\in U_x\)，若\(X\cap U_x=\emptyset\)，则\(\bigsqcup X\sqsubseteq x\)，矛盾。
\end{enumerate}
\end{proof}

\begin{corollary}[]
\(D\)是\(T_0\)空间
\end{corollary}

\begin{proof}
令\(x,y\in D\)且\(x\neq y\)，则\(x\in U_y\)且\(y\notin U_y\)。
\end{proof}

\begin{proposition}[]
考虑函数\(f:D\to D'\)，则
\begin{center}
\(f\)连续当且仅当对任意有向集\(X\subseteq D\)，\(f(\bigsqcup X)=\bigsqcup f(X)\)
\end{center}
其中\(f(X)=\{f(x)\mid x\in X\}\)。
\end{proposition}

\begin{proof}
\(\Rightarrow\)：若\(f\)连续，假设\(x\sqsubseteq y\)且\(f(x)\not\sqsubseteq' f(y)\)，则\(f(x)\in U_{f(y)}\)，
\(x\in f^{-1}(U_{f(y)})\)，由于\(f^{-1}(U_{f(y)})\)是开集，\(y\in f^{-1}(U_{f(y)})\)，
\(f(y)\in U_{f(y)}\)，矛盾。因此对于任意\(x\in X\)，\(f(\bigsqcup X)\sqsupseteq f(x)\)，\(f(\bigsqcup X)\sqsupseteq\bigsqcup f(X)\)。
若\(f(\bigsqcup X)\not\sqsubseteq\bigsqcup f(X)\)，则\(f(\bigsqcup X)\in U_{\bigsqcup f(X)}\)，\(\bigsqcup X\in f^{-1}(U_{\bigsqcup f(X)})\)，由定义，存
在\(a\in X\)使得\(a\in X\cap f^{-1}(U_{\bigsqcup f(X)})\)，因此\(f(a)\in U_{\bigsqcup f(X)}\)，\(f(a)\not\sqsubseteq\bigcup f(X)\)，矛盾。

\(\Leftarrow\)：若\(x\sqsubseteq y\)，则\(y=x\sqcup y\)，\(f(y)=f(x)\sqcup f(y)\)，因此\(f(x)\sqsubseteq f(y)\)。因此若\(O\subseteq D'\)是开集，
对于任意有向\(X\subseteq D\)且\(\bigsqcup X\in f^{-1}(O)\)，有\(f(\bigsqcup X)=\bigsqcup f(X)\in O\)，而\(f(X)\)是有向，于
是\(f(X)\cap O\neq\emptyset\)，因此\(X\cap f^{-1}(O)\neq\emptyset\)。
\end{proof}

\begin{proposition}[]
给定完全偏序\(D,D'\)，定义\(D\times D'\)上的偏序为
\begin{equation*}
(x,x')\sqsubseteq(y,y')\Leftrightarrow x\sqsubseteq y\wedge x'\sqsubseteq y'
\end{equation*}
则\(D\times D'\)是完全偏序，给定任意有向集\(X\subseteq D\times D'\)，它的最小上界是
\begin{equation*}
\bigsqcup X=(\bigsqcup X_0,\bigsqcup X_1)
\end{equation*}
其中
\begin{align*}
X_0&=\{x\in D\mid\exists x'\in  D'(x,x')\in X\}\\
X_1&=\{x'\in D'\mid\exists x\in D(x,x')\in X\}
\end{align*}
\end{proposition}

\begin{proof}
首先\((\bot,\bot')\)是\(D\times D'\)的最小元。对于任意有向集合\(X\subseteq D\times D'\)，\(X_0,X_1\)也是有向集合，因
此\(\bigsqcup X_0,\bigsqcup X_1\)存在，于是对于任意\(X\)的上界\((A,B)\)，\(A\)是\(X_0\)的上界，\(B\)是\(X_1\)的上
界，因此\((\bigsqcup X_0,\bigsqcup X_1)\sqsubseteq(A,B)\)，因此\(\bigsqcup X=(\bigsqcup X_0,\bigsqcup X_1)\)。
\end{proof}


\begin{definition}[]
给定完全偏序\(D,D'\)，定义
\begin{equation*}
[D\to D']=\{f:D\to D'\mid f\text{连续}\}
\end{equation*}
并且定义\([D\to D']\)上的偏序为
\begin{equation*}
f\sqsubseteq g\Leftrightarrow\forall x\in D(f(x)\sqsubseteq'g(x))
\end{equation*}
\end{definition}

\begin{lemma}[]
\label{1.2.10}
令\(\{f_i\}_i\subseteq[D\to D']\)为有向的函数集合，定义
\begin{equation*}
f(x)=\bigsqcup_if_i(x)
\end{equation*}
则\(f\)是良定义的并且是连续的。
\end{lemma}

\begin{proof}
应为\(\{f_i\}_i\)有向，因此对于任意\(x\in D\)，\(\{f_i(x)\}_i\)有向，因此\(f\)存在且\(f(x)\)唯一。对于任意
有向集合\(X\subseteq D\)，
\begin{equation*}
f(\bigsqcup X)=\bigsqcup_i\bigsqcup_{x\in X}f_i(x)=\bigsqcup_{x\in X}\bigsqcup_if_i(x)=\bigsqcup f(X)
\end{equation*}
\end{proof}

\begin{proposition}[]
\label{1.2.11}
\([D\to D']\)是完全偏序，并且对于任意有向\(F\subseteq[D\to D']\)，它的最小上界为
\begin{equation*}
(\bigsqcup F)(x)=\bigsqcup\{f(x)\mid f\in F\}
\end{equation*}
\end{proposition}

\begin{proof}
\(\metalambda x.\bot'\)是\([D\to D']\)的最小元，由引理\ref{1.2.10} ，\(\metalambda x.\bigsqcup\{f(x)\mid f\in F\}\)是
连续的，因此属于\([D\to D']\)，显然它是最小上界。
\end{proof}

\begin{proposition}[]
给定完全偏序\(D,D',D''\)，若\(f\in[D\to D']\)，\(g\in[D'\to D'']\)，定义\(g\circ f\)为对任意\(d\in D\)，
\((g\circ f)(d)=g(f(d))\)，则\(g\circ f\in[D\to D'']\)。
\end{proposition}

\begin{proof}
任给有向集合\(X\subseteq D\)，\(f\in[D\to D']\)，\(g\in[D'\to D'']\)，则
\begin{align*}
g\circ f(\bigsqcup X)&=g(f(\bigsqcup X))=g(\bigsqcup_{x\in X} f(x))=\bigsqcup_{x\in X}g(f(x))=\bigsqcup_{x\in X} g\circ f(x)
\end{align*}
\end{proof}


\begin{lemma}[]
\label{1.2.12}
令\(f:D\times D'\to D''\)，则\(f\)连续当且仅当它在\(D\)跟\(D'\)上连续，即对于任意\(x_0\in D,x_0'\in D'\)，
\(\metalambda x.f(x,x_0')\)和\(\metalambda x.f(x_0,x)\)连续。
\end{lemma}

\begin{proof}
\(\Rightarrow\)：令\(g=\metalambda x.f(x,x_0')\)，则对于有向集合\(X\subseteq D\)
\begin{align*}
g(\bigsqcup X)&=f(\bigsqcup X,x_0')=f(\bigsqcup\{(x,x_0')\mid x\in X\})\\
&=\bigsqcup\{f(x,x_0')\mid x\in X\}\\
&=\bigsqcup g(X)
\end{align*}
同理，\(\metalambda x.f(x_0,x)\)连续。

\(\Leftarrow\)：给定有向集合\(X\subseteq D\times D'\)，
\begin{align*}
f(\bigsqcup X)&=f(\bigsqcup X_0,\bigsqcup X_1)\\
&=\bigsqcup_{x\in X_0}f(x,\bigsqcup X_1)=\bigsqcup_{x\in X_0}\bigsqcup_{x'\in X_0'}f(x,x')\\
&=\bigsqcup_{(x,x')\in X}f(x,x')\\
&=\bigsqcup f(X)
\end{align*}
因此\(f\)连续。
\end{proof}

\begin{proposition}[]
\label{1.2.13}
定义
\begin{equation*}
app:[D\to D']\times D\to D'
\end{equation*}
为\(app(f,x)=f(x)\)，则\(app\)连续。
\end{proposition}

\begin{proof}
给定有向集合\(F\subseteq[D\to D']\)，令\(h=\metalambda f.f(x)\)，则
\begin{align*}
h(\bigsqcup F)&=(\bigsqcup F)(x)=\bigsqcup\{f(x)\mid f\in F\}\\
&=\bigsqcup\{h(f)\mid f\in F\}=\bigsqcup h(F)
\end{align*}
因此\(h\)连续，同时因为\(\metalambda x.f(x)=f\)连续，由命题\ref{1.2.11} \(app\)连续
\end{proof}

\begin{proposition}[]
\label{1.2.14}
给定\(f\in[D\times D'\to D'']\)，定义\(\hatf(x)=\metalambda y\in D'(f(x,y))\)，则
\begin{enumerate}
\item \(\hatf\)连续；
\item \(\metalambda f.\hatf:[D\times D'\to D'']\to[D\to[D'\to D'']]\)连续。
\end{enumerate}
\end{proposition}

\begin{proof}
\begin{enumerate}
\item 对于任意有向集\(X\subseteq D\)，
\begin{align*}
\hatf(\bigsqcup X)&=\metalambda y.f(\bigsqcup X,y)=\metalambda y.\bigsqcup_{x\in X}f(x,y)\\
&=\bigsqcup_{x\in X}(\metalambda y.f(x,y))\\
&=\bigsqcup\hatf(X)
\end{align*}
\item 令\(L=\metalambda f.\hatf\)，对于任意有向集\(F\subseteq[D\times D'\to D'']\)，
\begin{align*}
L(\bigsqcup F)&=\metalambda x.\metalambda y.(\bigsqcup F)(x,y)=\metalambda x\metalambda y.\bigsqcup_{f\in F}f(x,y)\\
&=\bigsqcup_{f\in F}\metalambda x.\metalambda y.f(x,y)=\bigsqcup L(F)
\end{align*}
\end{enumerate}
\end{proof}

\begin{definition}[]
\(\CPO\)是以完全偏序为元素连续映射为态射的范畴。
\end{definition}

\begin{theorem}[]
\(\CPO\)是笛卡儿闭范畴。
\end{theorem}

\begin{proof}
\(D\times D'\)是\(\CPO\)中的乘积，同时单元素完全偏序是终对象，而
对于任意\(f:D\times D'\to D''\)，由命题\ref{1.2.13} 和\ref{1.2.14} ，都存在
唯一的\(\hatf:D\to[D'\to D'']\)使得
\begin{center}\begin{tikzcd}
D\times D'\ar[r,"f"]\ar[d,dashed,"\hatf\times\id_{D'}"']&D\\
\left[D'\to D''\right]\times D'\ar[ur,"app"]
\end{tikzcd}\end{center}
交换。
\end{proof}

\begin{definition}[]
令\(D_0,D_1,\dots\)是可数的完全偏序序列，令\(f_i\in[D_{i+1}\to D_i]\)，
\begin{enumerate}
\item 序列\((D_i,f_i)\)称为完全偏序的 \textbf{逆向系统} (inverse system)。
\item 系统\((D_i,f_i)\)的 \textbf{逆向极限} (inverse limit) \(\varprojlim(D_i,f_i)\)（或记作\(\varprojlim D_i\)）是偏序集\((D_\infty,\sqsubseteq_\infty)\)，其中
\begin{align*}
D_\infty=\{(x_0,x_1,\dots)\mid\forall i\in\N(x_i\in D_i\wedge\psi_i(x_{i+1})=x_i)\}
\end{align*}
并且
\begin{equation*}
(x_0,x_1,\dots)\sqsubseteq_\infty(y_0,y_1,\dots)\Leftrightarrow\forall i\in\N(x_i\sqsubseteq y_i)
\end{equation*}
\end{enumerate}
\end{definition}

\begin{proposition}[]
给定逆向系统\((D_i,f_i)\)，则\(\varprojlim(D_i,f_j)\)是完全偏序且对任意有向\(X\subseteq\varprojlim D_i\)，
\begin{equation*}
\bigsqcup X=\metalambda i.\bigsqcup\{x(i)\mid x\in X\}
\end{equation*}
\end{proposition}

\begin{proof}
对于任意有向\(X\subseteq D_\infty\)，则对任意\(i\in\N\)，\(\{x(i)\mid x\in X\}\)有向，令
\begin{equation*}
y_i=\bigsqcup\{x(i)\mid x\in X\}
\end{equation*}
则由\(\psi_i\)的连续性，
\begin{equation*}
\psi_i(y_{i+1})=\bigsqcup f_i(\{x(i+1)\mid x\in X\})=\bigsqcup\{x(i)\mid x\in X\}=y_i
\end{equation*}
因此\((y_0,y_1,\dots)\in \varprojlim D_i\)。
\end{proof}

因此在\(\CPO\)中，逆向极限存在。

\begin{definition}[]
\begin{enumerate}
\item \(x\in D\)是 \textbf{紧致} (compact)的如果对每个有向集\(X\subseteq D\)都有
\begin{equation*}
x\sqsubseteq\bigsqcup X\Rightarrow \exists x\in X(x\sqsubseteq x_0)
\end{equation*}
\end{enumerate}
2.\(D\)是 \textbf{代数} 完全偏序（algebraic cpo）如果对于所有\(x\in D\)集合\(\{y\sqsubseteq x\mid y\text{紧致}\}\)是有向的并
且
\begin{equation*}
y=\bigsqcup\{y\sqsubseteq x\mid y\text{紧致}\}
\end{equation*}
\end{definition}
