course/Computability/report.tex

\section{\texorpdfstring{\(D_\infty\)}{D}}
\label{sec:org4ef5cb0}
\begin{definition}[]
给定完全偏序\(D\)和\(D'\)，\(D\)与\(D'\) \textbf{同构} 当且仅当存在\(\phi\in[D\to D']\)与\(\psi\in[D'\to D]\)使得
\begin{equation*}
\psi\circ\phi=\id_D,\quad\phi\circ\psi=\id_{D'}
\end{equation*}
\end{definition}


\begin{definition}[]
给定完全偏序\(D\)和\(D'\)。函数的二元组\(\la\varphi,\psi\ra\)是从\(D'\)到\(D\)的 \textbf{投射} 如果
\begin{enumerate}
\item \(\varphi\in[D\to D']\), \(\psi\in[D'\to D]\)
\item \(\psi\circ\varphi=\id_D\)
\item \(\varphi\circ\psi\sqsubseteq\id_{D'}\)
\end{enumerate}
\end{definition}

注意到\(D\)与\(\varphi\psi(D)\)同构，因此在同构的意义下\(D\subseteq D'\)。

接下来构造\(\lambda\)演算的模型\(D_\infty\)。

\begin{definition}[]
定义\(D_0=\N^+\)，\(D_{n+1}=[D_n\to D_n]\)，记\(D_n\)的最小元为\(\bot_n\)
\end{definition}

由\ref{1.2.11} ，对任意\(n\in\N\)，\(D_n\)是完全偏序。

\begin{lemma}[]
给定\(D'\)到\(D\)的投射\((\varphi,\psi)\)，存在从\([D'\to D']\)到\([D\to D]\)的投射\((\varphi^*,\psi^*)\)满足：对于任
意\(f\in[D\to D]\)，\(g\in[D'\to D']\)有
\begin{equation*}
\varphi^*(f)=\varphi\circ f\circ\psi,\quad\psi^*(g)=\psi\circ g\circ\varphi
\end{equation*}

\begin{center}\begin{tikzcd}
D\ar[d,"f"']&D'\ar[l,"\psi"']\ar[d,dashed,"\varphi^*(f)"]\\
D\ar[r,"\varphi"']&D'
\end{tikzcd}\quad\begin{tikzcd}
D\ar[r,"\varphi"]\ar[d,dashed,"\psi^*(g)"']&D'\ar[d,"g"]\\
D&D'\ar[l,"\psi"]
\end{tikzcd}\end{center}
\end{lemma}

\begin{proof}
注意到
\begin{align*}
\varphi^*(f)&=\metalambda x'\in D'.\varphi(f(\psi(x)))\\
&=\metalambda x'\in D'.\varphi(app(f,\psi(x)))
\end{align*}
于是\(\varphi^*\)是连续的，类似的\(\psi^*\)是连续的。同时
\begin{gather*}
\psi^*(\varphi^*(f))=\psi\circ\varphi\circ f\circ\psi\circ\varphi=f\\
\varphi^*(\psi^*(f))=\varphi\circ\psi\circ f\circ\varphi\circ\psi\sqsubseteq f
\end{gather*}
\end{proof}

\begin{lemma}[]
给定完全偏序\(D\)，定义\(\varphi_0:D\to[D\to D]\)，\(\psi_0:[D\to D]\to D\)为
\begin{align*}
&\varphi_0(x)=\metalambda y\in D.x\\
&\psi_0(f)=f(\bot)
\end{align*}
则\((\varphi_0,\psi_0)\)是从\([D\to D]\)到\(D\)的投射。
\end{lemma}

\begin{proof}
首先证明\(\varphi_0\)连续，给定有向集\(X\subseteq D\)，
\begin{align*}
\varphi_0(\bigsqcup X)&=\metalambda y\in D.\bigsqcup X=\bigsqcup_{x\in X}\metalambda y\in D.x\\
&=\bigsqcup\varphi_0(X)
\end{align*}
同理，\(\psi_0\)连续。同时
\begin{align*}
\varphi_0(\psi_0(f))&=\varphi_0(f(\bot))=\metalambda x.f(\bot)\\
&\sqsubseteq\metalambda x.f(x)=f\\
\psi_0\circ\varphi_0(f)&=\varphi_0(f)(\bot)=f
\end{align*}
\end{proof}

\begin{definition}[构造\(D_\infty\)]
给定完全偏序\(D\)与\((\varphi_0,\psi_0)\)如上，定义
\begin{align*}
&D_0=D\\
&D_{n+1}=[D_n\to D_n]\\
&(\varphi_{n+1},\psi_{n+1})=(\varphi_n^*,\psi_n^*)
\end{align*}
令\(D_\infty=\varprojlim(D_n,\psi_n)\)。
\end{definition}


记\(x\in D_\infty\)为\((x_0,x_1,\dots)\)。

\begin{definition}[]
\begin{enumerate}
\item 对于\(n,m\in\N\)，定义\(\Phi_{nm}:D_n\to D_m\)为：

若\(n\le m\), \(m=n+k\)，则递归定义\(\Phi_{nm}\)为
\begin{align*}
&\Phi_{nn}=\lambda x\in D_n.x\\
&\Phi_{n(m+1)}=\varphi_m\circ\Phi_{nm}
\end{align*}
若\(m\le n\)，\(n=m+k\)，递归定义\(\Phi_{nm}\)为
\begin{equation*}
\Phi_{(n+1)m}=\Phi_{nm}\circ\psi_n
\end{equation*}
\item 定义\(\Phi_{\infty n}:D_\infty\to D_n\)为\(\Phi_{\infty n}(x)=x_n\)。
\item 定义\(\Phi_{n\infty}:D_n\to D_\infty\)为\(\Phi_{n\infty}(x)=(\Phi_{ni}(x))_{i\in\N}\)
\end{enumerate}
\end{definition}

\begin{lemma}[]
\begin{enumerate}
\item 对于\(0\le n\le m\le\infty\)，\((\Phi_{nm},\Phi_{mn})\)是从\(D_m\)到\(D_n\)的投射
\item 对于\(0\le n\le m\le l\le\infty\)，\(\Phi_{ml}\circ\Phi_{nm}=\Phi_{nl}\)
\end{enumerate}
\end{lemma}

\begin{proof}
\begin{enumerate}
\item 若\(n<m<\infty\)，对于任意\(x\in D_m\)，
\begin{align*}
\Phi_{nm}\circ\Phi_{mn}&=(\varphi_{m-1}\circ\dots\circ\varphi_n\circ\id_{D_n})\circ(\id_{D_n}\circ\psi_n\circ\dots\circ\psi_{m-1})\\
&\sqsubseteq\id_{D_m}\\
\Phi_{mn}\circ\Phi_{nm}&=(\id_{D_n}\circ\psi_1\circ\dots\circ\psi_{m-1})\circ(\varphi_{m-1}\circ\dots\circ\varphi_1\circ\id_{D_n})\\
&=\id_{D_n}
\end{align*}
\(n<m=\infty\)和\(n=m=\infty\)的情况类似。
\item 根据定义类似可得。
\end{enumerate}
\end{proof}

注意到在同构的意义下，
\begin{equation*}
D_0\subseteq D_1\subseteq\dots\subseteq D_\infty
\end{equation*}
又有一个事实是在\(\CPO\)中，\(D_\infty\)不仅是逆向极限，也是正向极限
\begin{equation*}
D_\infty\cong\varinjlim(D_n,\varphi_n)
\end{equation*}
因此每个元素\(x\in D_n\)也可被\(\Phi_{n\infty}(x)\in D_\infty\)刻画。

\begin{lemma}[]
\begin{enumerate}
\item 如果\(x\in D_n\)，则\((\Phi_{n\infty}(x))n=x\)。
\item 如果\(x\in D_n\)，则\(\varphi_n(x)=x\)。
\item 如果\(x\in D_{n+1}\)，则\(\psi_n(x)\sqsubseteq x\)。
\end{enumerate}
\end{lemma}

\begin{proof}
\begin{enumerate}
\item 在\(D_\infty\)中，\(x\)为\(\Phi_{n\infty}(x)\)，因此\(x_n=x\)。
\item \(\varphi_n(x)\)在\(D_\infty\)中为\((\dots,\psi_n(\varphi_n(x)),\varphi_n(x),\varphi_{n+1}\varphi_n(x),\dots)\)，因
为\(\psi_n(\varphi_n(x))=x\)，因此\(\varphi_n(x)=x\)。
\item 类似。
\end{enumerate}
\end{proof}

\begin{lemma}[]
在\(D_\infty\)中，若\(x\in D_\infty\)，则
\begin{enumerate}
\item \((x_n)_m=x_{\min(n,m)}\)
\item \(n\le m\Rightarrow x_n\sqsubseteq x_m\sqsubseteq x\)
\item \(x=\bigsqcup_{n\in\N}x_n\)
\item \(\bot_n\)是\(D_n\)的最小元素
\item \(\bot_n=\bot\)
\end{enumerate}
\end{lemma}

\begin{proof}
\begin{enumerate}
\item 若\(n<m\)，则
\begin{equation*}
(x_n)_m=\Phi_{nm}x_n=
\end{equation*}
\end{enumerate}
\end{proof}

\begin{lemma}[]
若\(x,y\in D_\infty\)，则对所有\(n,k\in\N\)，\(n\le k\)，则
\begin{enumerate}
\item \(x_{n+1}(y_n)\sqsubseteq x_{k+1}(y_k)\)
\item \((x_{n+1})_{k+1}(y_k)=x_{n+1}(y_n)\)
\item \((x_{k+1}(y_n)_k)_n=x_{n+1}(y_n)\)
\end{enumerate}
\end{lemma}

\begin{lemma}[]
对于任意\(x\in D_\infty\)，任意\(n,r\ge 0\)，
\begin{enumerate}
\item \(\Phi_{(n+r)n}(x_{n+r})=x_n\)
\item \(\Phi_{n\infty}(x_n)\sqsubseteq\Phi_{(n+1)\infty}(x_{n+1})\)
\item \(x=\bigsqcup_{n\ge 0}\Phi_{n\infty}(x_n)=\bigsqcup_{n\ge r}\Phi_{n\infty}(x_n)\)
\end{enumerate}
\end{lemma}

\begin{proof}
\begin{enumerate}
\item 根据定义。
\item ​
\begin{align*}
\Phi_{n\infty}(a_n)&=\Phi_{n\infty}(\psi_n(a_{n+1}))=\Phi_{(n+1)\infty}(\phi_n(\psi_n(a_{n+1})))\\
&\sqsubseteq\Phi_{(n+1)\infty}(a_{n+1})
\end{align*}
\item 令\(X=\{\phi_{n,\infty}(a_n):n\ge 0\}\)，则由2，\(X\)是一个递增的序列，因此是有向的，因此\(\bigsqcup X\)存在，同
时对于任意\(r\ge 0\)，都有\(\bigsqcup X=\bigsqcup_{n\ge r}\Phi_{n\infty}(a_n)\)。同时，
\begin{align*}
(\bigsqcup X)_p&=(\bigsqcup_{n\ge p}\Phi_{n\infty}(a_n))_p=\bigsqcup_{n\ge p}(\Phi_{n\infty}(a))_p\\
&=\bigsqcup_{n\ge p}\Phi_{n,p}(a_n)=\bigsqcup\{a_p\}\\
&=a_p
\end{align*}
\end{enumerate}
\end{proof}

\begin{lemma}[]
\label{16.42}
对于任意\(x,y\in D_\infty\)，
\begin{equation*}
\Phi_{n\infty}(x_{n+1}(y_n))\sqsubseteq\Phi_{(n+1)\infty}(x_{n+2}(y_{n+1}))
\end{equation*}
\end{lemma}

\begin{proof}
首先
\begin{align*}
\phi_n(x_{n+1}(y_n))&=\phi_n(\psi_{n+1}(x_{n+2})(\psi_{n}(y_{n+1})))\\
&=\phi_n(\psi_n(x_{n+2}(\phi_n(\psi_n(y_{n+1})))))\\
&\sqsubseteq\phi_n(\psi_n(x_{n+2}(y_{n+1})))\\
&\sqsubseteq x_{n+2}(y_{n+1})
\end{align*}
于是
\begin{align*}
\Phi_{(n+1)\infty}(\phi_n(x_{n+1}(y_n)))\sqsubseteq\Phi_{(n+1)\infty}(x_{n+2}(y_{n+1}))
\end{align*}
注意到\(\Phi_{(n+1)\infty}\phi_n=\Phi_{(n+1)\infty}\Phi_{n(n+1)}=\Phi_{n\infty}\)，因此
\begin{equation*}
\Phi_{n\infty}(x_{n+1}(y_n))\sqsubseteq\Phi_{(n+1)\infty}(x_{n+2}(y_{n+1}))
\end{equation*}
\end{proof}

\begin{definition}[]
给定\(x,y\in D_\infty\)，于是由引理\ref{16.42} ，\(\{\Phi_{n\infty}(x_{n+1}(y_n)):n\ge 0\}\)是一个递增序列，因此有最
小上界，定义
\begin{equation*}
a\cdot b=\bigsqcup_{n\ge 0}\Phi_{n\infty}(a_{n+1}(b_n))
\end{equation*}
\end{definition}


\begin{corollary}[]
对于任意\(x,y\in D_\infty\)以及所有\(r\ge 0\)
\begin{enumerate}
\item \(x\cdot y=\bigsqcup_{n\ge r}\Phi_{n\infty}(x_{n+1}(y_n))\)；
\item \((x\cdot y)_r=\bigsqcup_{n\ge r}\Phi_{nr}(x_{n+1}(y_n))\)；
\item \((x\cdot y)_r\sqsupseteq x_{r+1}(y_r)\)
\end{enumerate}
\end{corollary}

\begin{proof}
\begin{enumerate}
\item 因为\(\{\Phi_{n\infty}(x_{n+1}y_n): n\ge 0\}\)是递增序列。
\item \begin{align*}
(x\cdot y)_r&=\left( \bigsqcup_{n\ge r}\Phi_{n\infty}(x_{n+1}(y_n)) \right)_r\\
&=\bigsqcup_{n\ge r}(\Phi_{n\infty}(x_{n+1}(y_n)))_r\\
&=\bigsqcup_{n\ge r}\Phi_{nr}(x_{n+1}(y_n))
\end{align*}
\end{enumerate}
\end{proof}
*
\end{document}
